# Ejercicios

In [1]:
import pandas as pd

__Ejercicio 1:__

In [2]:
lista=["caballo","perro","gato", "conejo","loro","jirafa"]

Guardar la lista anterior en una Serie llamada "animales"

In [3]:
animales=pd.Series(lista)
animales

0    caballo
1      perro
2       gato
3     conejo
4       loro
5     jirafa
dtype: object

Transformar los nombres de animales anteriores a letras mayúsculas

In [4]:
animales.str.upper()

0    CABALLO
1      PERRO
2       GATO
3     CONEJO
4       LORO
5     JIRAFA
dtype: object

__Ejercicio 2:__ Cambiar la primera letra en el nombre de los animales a mayuscula

In [5]:
animales.str.title()

0    Caballo
1      Perro
2       Gato
3     Conejo
4       Loro
5     Jirafa
dtype: object

__Ejercicio 3:__ Unir todas las filas de la serie animales en un único string

In [6]:
animales.str.cat(sep = " ")

'caballo perro gato conejo loro jirafa'

__Ejercicio 4:__

In [7]:
lista=["Colombia,Mexico,Argentina,Argentina",
       "Chile,Chile,Mexico,Colombia",
       "Colombia,Chile,Colombia,Argentina",
       "Mexico, Argentina,Colombia,Mexico"]

Guardar la lista anterior en una Serie llamada "paises"

In [8]:
paises=pd.Series(lista)
paises.head()

0    Colombia,Mexico,Argentina,Argentina
1            Chile,Chile,Mexico,Colombia
2      Colombia,Chile,Colombia,Argentina
3      Mexico, Argentina,Colombia,Mexico
dtype: object

Contar cuantas veces se repite el pais "Colombia" en cada registro de la serie paises

In [9]:
paises.str.count("Colombia")

0    1
1    1
2    2
3    1
dtype: int64

__Ejercicio 5:__ Mantener únicamente los datos en la serie "paises" que contenga a "Argentina"

In [10]:
paises[paises.str.contains("Argentina")]

0    Colombia,Mexico,Argentina,Argentina
2      Colombia,Chile,Colombia,Argentina
3      Mexico, Argentina,Colombia,Mexico
dtype: object

__Ejercicio 6:__ Mantener únicamente los datos en la serie "paises" cuyo último nombre sea "Mexico"

In [11]:
paises[paises.str.endswith("Mexico")]

3    Mexico, Argentina,Colombia,Mexico
dtype: object

In [12]:
paises

0    Colombia,Mexico,Argentina,Argentina
1            Chile,Chile,Mexico,Colombia
2      Colombia,Chile,Colombia,Argentina
3      Mexico, Argentina,Colombia,Mexico
dtype: object

__Ejercicio 7:__ Separar cada dato de la serie paises en un array utilizando como divisor la coma (",")

In [13]:
paises.str.split(",")

0    [Colombia, Mexico, Argentina, Argentina]
1            [Chile, Chile, Mexico, Colombia]
2      [Colombia, Chile, Colombia, Argentina]
3      [Mexico,  Argentina, Colombia, Mexico]
dtype: object

__Ejercicio 8:__ Obtener el segundo pais dentro de cada registro de la serie "paises"

In [14]:
paises.str.split(",").str.get(1)

0        Mexico
1         Chile
2         Chile
3     Argentina
dtype: object

__Ejercicio 9:__ Crear un DataFrame a partir de la serie paises, utilizando la función split para colocar un pais por columna

In [15]:
paises2 = paises.str.split("," , expand=True)
paises2

          0           1          2          3
0  Colombia      Mexico  Argentina  Argentina
1     Chile       Chile     Mexico   Colombia
2  Colombia       Chile   Colombia  Argentina
3    Mexico   Argentina   Colombia     Mexico

In [16]:
paises2.columns= ["pais 1","pais 2", "pais 3", "pais 4"]
paises2

     pais 1      pais 2     pais 3     pais 4
0  Colombia      Mexico  Argentina  Argentina
1     Chile       Chile     Mexico   Colombia
2  Colombia       Chile   Colombia  Argentina
3    Mexico   Argentina   Colombia     Mexico

__Ejercicio 10:__ Crear una serie con la siguiente lista llamada paises2

In [17]:
lista= [
        "Francia,Suecia",
        "Italia,Alemania",
        "Irlanda,Francia",
        "Portugal,Alemania"
    ]

In [18]:
paises2=pd.Series(lista)
paises2

0       Francia,Suecia
1      Italia,Alemania
2      Irlanda,Francia
3    Portugal,Alemania
dtype: object

Unir con la función cat el contenido de las series paises y paises2

In [19]:
paises + "," + paises2

0    Colombia,Mexico,Argentina,Argentina,Francia,Su...
1          Chile,Chile,Mexico,Colombia,Italia,Alemania
2    Colombia,Chile,Colombia,Argentina,Irlanda,Francia
3    Mexico, Argentina,Colombia,Mexico,Portugal,Ale...
dtype: object

In [20]:
paises.str.cat(paises2, sep=",")

0    Colombia,Mexico,Argentina,Argentina,Francia,Su...
1          Chile,Chile,Mexico,Colombia,Italia,Alemania
2    Colombia,Chile,Colombia,Argentina,Irlanda,Francia
3    Mexico, Argentina,Colombia,Mexico,Portugal,Ale...
dtype: object

__Ejercicio 11:__ Utilizar la función slice para obtener las 3 primeras letras de cada dato en la serie paises

In [21]:
paises.str.slice(start=0, stop=3)

0    Col
1    Chi
2    Col
3    Mex
dtype: object

__Ejercicio 12:__ Reemplazar el separador en la serie paises (",") por un guion medio ("-")

In [22]:
paises.str.replace(",","-")

0    Colombia-Mexico-Argentina-Argentina
1            Chile-Chile-Mexico-Colombia
2      Colombia-Chile-Colombia-Argentina
3      Mexico- Argentina-Colombia-Mexico
dtype: object

__Ejercicio 13:__

In [23]:
lista=["Manzana","Uva","Cereza","Sandia","Melon"]

Guardar la lista anterior en una Serie llamada "frutas"

In [24]:
frutas= pd.Series(lista)

Transformar los nombres de animales anteriores a letras minusculas

In [25]:
frutas.str.lower()

0    manzana
1        uva
2     cereza
3     sandia
4      melon
dtype: object

__Ejercicio 14:__ Obtener la cantidad de letras que tiene cada nombre de fruta

In [26]:
frutas.str.len()

0    7
1    3
2    6
3    6
4    5
dtype: int64

__Ejercicio 15:__ Unir el nombre de todas las frutas en una sola cadena, utilizando la funcion cat

In [27]:
frutas.str.cat(sep="|")

'Manzana|Uva|Cereza|Sandia|Melon'

__Ejercicio 16:__

In [28]:
lista=["Ciclismo,Golf,Tenis,Atletismo",
       "Tenis,Golf,Ciclismo,Tenis",
       "Ciclismo,Atletismo,Atletismo,Ciclismo",
       "Natacion, Natacion,Tenis,Natacion"]

Guardar la lista anterior en una Serie llamada "deportes"

In [29]:
deportes= pd.Series(lista)

Contar cuantas veces se repite "Golf" en cada registro de la serie paises

In [30]:
deportes.str.count("Golf")

0    1
1    1
2    0
3    0
dtype: int64

__Ejercicio 17:__ Mantener únicamente los datos en la serie "deportes" que contenga "Atletismo"

In [31]:
deportes[deportes.str.contains("Atletismo")]

0            Ciclismo,Golf,Tenis,Atletismo
2    Ciclismo,Atletismo,Atletismo,Ciclismo
dtype: object

__Ejercicio 18:__ Mantener únicamente los datos en la serie "deportes" cuyo primero deporte sea "Ciclismo"

In [32]:
deportes[deportes.str.startswith("Ciclismo")]

0            Ciclismo,Golf,Tenis,Atletismo
2    Ciclismo,Atletismo,Atletismo,Ciclismo
dtype: object

__Ejercicio 19:__ Separar cada dato de la serie deportes en un array utilizando como divisor la coma (",")

In [33]:
deportes.str.split(",")

0            [Ciclismo, Golf, Tenis, Atletismo]
1                [Tenis, Golf, Ciclismo, Tenis]
2    [Ciclismo, Atletismo, Atletismo, Ciclismo]
3        [Natacion,  Natacion, Tenis, Natacion]
dtype: object

__Ejercicio 20:__ Obtener el tercer deporte dentro de cada registro de la serie "deportes"

In [34]:
deportes.str.split(",").str.get(2)

0        Tenis
1     Ciclismo
2    Atletismo
3        Tenis
dtype: object

__Ejercicio 21:__  Crear un DataFrame a partir de la serie "deportes", utilizando la función split para colocar un deporte por columna

In [35]:
deportes_df=deportes.str.split(",", expand=True)
deportes_df

          0          1          2          3
0  Ciclismo       Golf      Tenis  Atletismo
1     Tenis       Golf   Ciclismo      Tenis
2  Ciclismo  Atletismo  Atletismo   Ciclismo
3  Natacion   Natacion      Tenis   Natacion

__Ejercicio 22:__ Crear una serie con la siguiente lista llamada deportes2

In [36]:
lista= ["Beisbol,Karate","Karate,Rugbi","Rugbi,Beisbol"]

In [37]:
deportes2=pd.Series(lista)

Unir con la función cat el contenido de las series deportes y deportes2

In [38]:
deportes.str.cat(deportes2,sep=",")

0         Ciclismo,Golf,Tenis,Atletismo,Beisbol,Karate
1               Tenis,Golf,Ciclismo,Tenis,Karate,Rugbi
2    Ciclismo,Atletismo,Atletismo,Ciclismo,Rugbi,Be...
3                                                  NaN
dtype: object

__Ejercicio 23:__  Utilizar la función slice para obtener las 4 primeras letras de cada dato en la serie deportes

In [39]:
deportes.str.slice(stop=4)

0    Cicl
1    Teni
2    Cicl
3    Nata
dtype: object

__Ejercicio 24:__ Reemplazar el separador en la serie deportes (",") por una diagona ("/")

In [40]:
deportes.str.replace(",","/")

0            Ciclismo/Golf/Tenis/Atletismo
1                Tenis/Golf/Ciclismo/Tenis
2    Ciclismo/Atletismo/Atletismo/Ciclismo
3        Natacion/ Natacion/Tenis/Natacion
dtype: object